---

 # 2차원 리스트나 2차원 numpy array로 DataFrame을 만들 수 있음

- 대문자 주의

In [5]:
import numpy as np
import pandas as pd

In [6]:
list = [['dongwook', 50, 86], ['sineui', 86, 31], ['ikjoong', 68, 91], ['yoonsoo', 88, 75]]

In [8]:
arr = np.array(list)
dfx = pd.read_table

In [17]:
# 대문자 주의
seri = [
    pd.Series(['dongwook', 50, 86]),
    pd.Series(['sineui', 86, 31]),
    pd.Series(['ikjoong', 68, 91]),
    pd.Series(['yoonsoo', 88, 75])
]

In [19]:
df1 = pd.DataFrame(list)
df2 = pd.DataFrame(arr)
df3 = pd.DataFrame(seri)

In [20]:
df1

          0   1   2
0  dongwook  50  86
1    sineui  86  31
2   ikjoong  68  91
3   yoonsoo  88  75

In [21]:
df2

          0   1   2
0  dongwook  50  86
1    sineui  86  31
2   ikjoong  68  91
3   yoonsoo  88  75

In [22]:
df3

          0   1   2
0  dongwook  50  86
1    sineui  86  31
2   ikjoong  68  91
3   yoonsoo  88  75

In [24]:
names = ['dongwook', 'sineui', 'ikjoong','yoonsoo']
english_scores = [50, 89, 68 ,88]
math_scores = [86, 31, 91, 75]

In [25]:
dic1 = {
    'name' : names,
    'english_score' : english_scores,
    'math_score' : math_scores
}

In [26]:
dic2 = {
    'name' : np.array(names),
    'english_score' : np.array(english_scores),
    'math_score' : np.array(math_scores)
}

In [27]:
dic3 = {
    'name' : pd.Series(names),
    'english_score' : pd.Series(english_scores),
    'math_score' : pd.Series(math_scores)
}

In [28]:
df_dic1 = pd.DataFrame(dic1)
df_dic2 = pd.DataFrame(dic2)
df_dic3 = pd.DataFrame(dic3)

In [29]:
df_dic1

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

In [30]:
df_dic2

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

In [31]:
df_dic3

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75